package com.company;

import com.company.Func.ClientList;
import com.company.Func.UserFunctions;
import com.company.Users.Client;

import java.text.ParseException;
import java.text.SimpleDateFormat;

public class Main {
    private static UserFunctions userFunctions = new UserFunctions();
    private static ClientList clientList = new ClientList();
    private static boolean isSuccess = true;


    public static void main(String[] args) throws ParseException {
        clientList.addClient("Test1", "Test1", new SimpleDateFormat("dd/MM/yyyy").parse("22/13/2021"));

        //Цялата информация да се пази, записва и зарежда в и от текстови файлове.
//        Система за следене на времето в компания
//        Често големите компании използват т.нар. ERP системи (Enterprise Resource Planning) за да следят клиенто-потока,
//        приходи и разходи, текущи проекти и изработеното време по тези проекти.
//        За целта, създайте програма с два типа потребители - админ и служител.
//        Аминът ще администрира данните в програмата, а служителят ще може да указва колко време по кой проект е работил.
//
//        Приложението трябва да:
//        Няма нужда от графичен интерфейс.
//                Има логин страница
//        Има един админ потребител
//        При логване с админ потребител, той вижда меню с опции
//        Когато се логне админ потребител той може
//        Да въвежда нови клиенти. Всеки клиент има име, име на проекта по който се работи, дата на изтичане на договора.
//        Да регистрира нови служители. Въвежда уникално потребителско име за служителя и парола.
//        Да гледа статистика за служителите
//        Може да търси по име на служител. Така намира той за колко време по кои проекти е работил.
//                Може да търси по номер на седмица. Така вижда за въпросната седмица кои служители колко време са работили.
//                Когато се логне служител той може:
//        Да създава протокол за деня в който да пише.За кои клиенти е работил днес.
//        По колко време на клиент
//        Цялата информация да се пази, записва и зарежда в и от текстови файлове.
//
    }
}